<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"b333353dedecd0db5dc7902b7caf4dddb0873bef2306e0ffb040044e95b8887d","plan_job_ref":"Job Create terraform plan #23 at https://github.com/coforma/co-boomi-atom-fargate/actions/runs/6699321129","plan_hash":"2962a0c16400790e6c769a773f6cf8980c39495c1b949c68c76900ecf21ad117","plan_text_format":"text","version":"1.37.0"} -->
Terraform plan in __.__
<details>
<summary>Plan: 3 to add, 1 to change, 2 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/c56ed70bd19d7e94bda2a54678566f57e0b9043183828cea15227472e80a8c11.zip" -> "builds/95a24d2d459e9667d143cc784fe716c544b64510f1d5915866a54b5b2680f96b.zip"
        id                             = "co-boomi-atom-secret-install-lambda"
      ~ last_modified                  = "2023-10-29T19:16:51.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:950012193416:function:co-boomi-atom-secret-install-lambda:15" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:950012193416:function:co-boomi-atom-secret-install-lambda:15/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "15" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_permission.current_version_triggers["secrets"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "*******" -> (known after apply)
      ~ qualifier           = "15" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "./lambda/rotate_install_token.py",
                      + null,
                    ],
                  + [
                      + "zip",
                      + "./lambda/package/",
                      + null,
                    ],
                ]
              + filename      = "builds/95a24d2d459e9667d143cc784fe716c544b64510f1d5915866a54b5b2680f96b.zip"
              + runtime       = "python3.11"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/95a24d2d459e9667d143cc784fe716c544b64510f1d5915866a54b5b2680f96b.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "*****************" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/c56ed70bd19d7e94bda2a54678566f57e0b9043183828cea15227472e80a8c11.zip" -> "builds/95a24d2d459e9667d143cc784fe716c544b64510f1d5915866a54b5b2680f96b.zip"
          ~ "timestamp" = "1698617256803147000" -> "1698704060553600000"
        }
    }

Plan: 3 to add, 1 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #23](https://github.com/coforma/co-boomi-atom-fargate/actions/runs/6699321129)